SchoolBase/Documents/ПереводВДругойКласс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереводВДругойКласс</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеревода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзКласса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКласс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассыНаМоментЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ученики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

SchoolBase/Documents/ПереводВДругойКласс/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Для Каждого Актив Из ТекущийОбъект.Ученики Цикл
		Ученики = Актив.Ученик.ПолучитьОбъект();
		Ученики.Класс = Объект.ВКласс;
		Ученики.Записать();   
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ИзКлассПриИзменении(Элемент)
	Объект.КлассыНаМоментЗаписи = "Из " + Объект.ИзКласса + " в " + Объект.ВКласс;
КонецПроцедуры

&НаКлиенте
Процедура ВКлассПриИзменении(Элемент)
	Объект.КлассыНаМоментЗаписи = "Из " + Объект.ИзКласса + " в " + Объект.ВКласс;
КонецПроцедуры
